Tekla Open API Reference for Tekla Structures 2025
MarkBase.MarkBaseAttributes.TextAlignment Property
 The mark text alignment.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MarkBase.MarkBaseAttributes.TextAlignOptions TextAlignment { get; set; }
Public Property TextAlignment As MarkBase.MarkBaseAttributes.TextAlignOptions
	Get
	Set
Property Value
Type: MarkBase.MarkBaseAttributes.TextAlignOptions
See Also
Reference
MarkBase.MarkBaseAttributes Class
Tekla.Structures.Drawing Namespace